<a href="https://colab.research.google.com/github/KARENCMP82/SQL/blob/main/Clase_09_SQL_Semana_2_para_seguir_videos_sentencias_ejercicios_vacios.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [5]:
import sqlite3
import pandas as pd

Creamos una nueva base de datos para estos ejercicios

In [6]:
database = '/content/drive/MyDrive/Colab Notebooks/parte2_ejercicios.db'

In [7]:
import os
os.makedirs('/content/drive/MyDrive/Colab Notebooks', exist_ok=True)

In [8]:
import sqlite3

# Ruta a la base de datos
database = '/content/drive/MyDrive/Colab Notebooks/parte2_ejercicios.db'

# Crear o conectar a la base de datos
conexion = sqlite3.connect(database)
cursor = conexion.cursor()

print("Base de datos creada o abierta con éxito.")

Base de datos creada o abierta con éxito.

In [9]:
import os

if os.path.exists(database):
    print(f"El archivo '{database}' fue creado exitosamente.")
else:
    print("Hubo un problema al crear el archivo.")

El archivo '/content/drive/MyDrive/Colab Notebooks/parte2_ejercicios.db' fue creado exitosamente.

# Ejercicios prácticos con las sentencias

Vamos a crear una tabla llamada "vendedores" cuya estructura de datos sea la siguiente:

* id_vendedor: esta columna tendrá que ser un número y se la clave primaria de la tabla.
* id_tienda: un número de identificador de tienda donde trabaja ese vendedor. Por defecto el id_tienda deberá ser el 1001.
* nombre: Una cadena de caracteres (texto) con el nombre del vendedor. Los valores de esta columna no pueden quedar vacios.
* apellido: Una cadena de caracteres (texto) con el apellido del vendedor. Los valores de esta columna no pueden quedar vacios.
* salario: un número. Los valores de esta columna no pueden quedar vacios.

In [10]:
query = '''
CREATE TABLE vendedores (
    id_vendedor INTEGUER PRIMARY KEY,
    id_tienda INTEGUER DEFAULT 1001,
    nombre VARCHAR(50) not null,
    apellido VARCHAR(50) not null,
    salario DECIMAL(10, 2) not null
);


 '''

cursor.execute(query)
conexion.commit()

Vamos a insertar 3 vendedores en la tabla vendores:

* Id de vendedor 100001, id de tienda 1002, llamado FRANCISCO MARRON y con un salario de 15000 anuales.
* Siguiente id de vendedor, mismo id de tienda, llamada SUSANA ROMERO con un salario de 20000 anuales.
* Siguiente id de vendedor, id de tienda 1005, llamada ANTONIA CASTO con un salario de 20000 anuales.

In [13]:
query = '''
INSERT INTO vendedores (id_vendedor, id_tienda, nombre, apellido, salario)
VALUES
(100001, 1002, 'Francisco', 'Marron', 15000),
(100002, 1002, 'Susana', 'Romero', 20000),
(100003, 1005, 'Antonia', 'Casto', 20000);
'''

cursor.execute(query)
conexion.commit()

Ahora vamos a crear una segunda tabla de vendedores (llamada vendedores_2) con los mismos valores y misma estructura de la tabla vendedores pero omitiendo al vendedor 100001, FRANCISCO MARRON.

In [17]:
query = '''
CREATE TABLE vendedores2 AS
SELECT * FROM vendedores where id_vendedor<>100001



 '''

cursor.execute(query)
conexion.commit()

In [27]:
query = '''
select * from  vendedores2

 '''

cursor.execute(query)
# Leer los datos en un DataFrame de pandas
data = pd.read_sql_query(query, conexion)

# Mostrar los datos
print(data)
conexion.commit()

   id_vendedor  id_tienda     nombre apellido  salario
0       100002       1002     Susana   Romero    20000
1       100003       1005    Antonia    Casto    20000
2       100001       1002  Francisco   Marron    15000

Ahora que tenemos la tabla vendedores y la tabla vendedores_2, vamos a insertar en la tabla vendedores_2 el vendedor FRANCISCO MARRON que habiamos omitido, pero vamos a utilizar diréctamente los datos de la tabla vendedores en vez de insertar uno a uno los datos necesarios.

In [24]:
query = '''
INSERT INTO vendedores2 (id_vendedor, id_tienda, nombre, apellido, salario)
SELECT id_vendedor, id_tienda, nombre, apellido, salario
FROM vendedores
WHERE id_vendedor = 100001;




 '''

cursor.execute(query)
conexion.commit()

Ahora vamos a insertar 2 vendedores mas en la tabla vendedores, dejando vacio el id_vendedor y el id_tienda
* ADRIAN HERNANDEZ, 30000 euros anuales
* EDGAR ROBERTSON, 50000 euros anuales.

In [39]:
query = '''
INSERT INTO vendedores ( nombre, apellido, salario)
VALUES
( 'Adrian', 'Hernandez', 30000),
( 'Edgar', 'Robertson', 50000);




'''

cursor.execute(query)
conexion.commit()

In [46]:
query = '''
select * from  vendedores

 '''

cursor.execute(query)
# Leer los datos en un DataFrame de pandas
data = pd.read_sql_query(query, conexion)

# Mostrar los datos
print(data)
conexion.commit()

   id_vendedor  id_tienda   nombre   apellido  salario
0     100003.0       1005  Antonia      Casto    20000
1          NaN       1001   Adrian  Hernandez    30000

Ahora borraremos los vendedores que tengan salario menor a 20000 y vendedores cuyo apellido comiencen con R.

In [45]:
query = '''
DELETE FROM vendedores WHERE salario<20000 OR apellido like 'R%';



 '''

cursor.execute(query)
conexion.commit()

Vamos a crear la tabla "clientes" tal cual veníamos creándola anteriormente:

* id_cliente: in número entero. Tiene que ser clave primaria.
* nombre: un texto. No puede aceptar valores nulos.
* apellido: un texto. No puede aceptar valores nulos..
* edad: un número. No puede aceptar valores menor a 18 años.
* provincia: un texto. No puede aceptar valores nulos.
* fecha_alta: un texto. No puede aceptar valores nulos.

In [48]:
query = '''
CREATE TABLE clientes (
    id_cliente INTEGER PRIMARY KEY,
    nombre VARCHAR(50) NOT NULL,
    apellido VARCHAR(50) NOT NULL,
    edad INTEGER CHECK(edad > 18),
    provincia VARCHAR(50) NOT NULL,
    fecha_alta VARCHAR(50) NOT NULL
);


'''

cursor.execute(query)
conexion.commit()

Insertamos datos en la nueva tabla clientes utilizando los valores listados en la próxima celda. Simplemente completar la consulta con las partes que faltan de la sentencia INSERT.

In [50]:

query = '''
INSERT INTO clientes ( id_cliente, nombre, apellido,edad,provincia,fecha_alta  )
VALUES

(100002,	'ALVARO',	'TORRES',	46,	'Salta',	'2021-03-03'),
(100003,	'ANA',	'GONZÁLEZ',	40,	'Jujuy',	'2021-11-02'),
(100004,	'ANDREA',	'NAVARRO',	35,	'Córdoba',	'2021-04-21'),
(100005,	'CRISTINA',	'SALINAS',	46,	'Córdoba',	'2021-04-21'),
(100006,	'DANIEL',	'SETIÉN',	43,	'Buenos Aires',	'2021-04-21'),
(100007,	'DAVID',	'CRUZ',	46,	'La Pampa',	'2021-04-13'),
(100008,	'DIEGO',	'GARCÍA',	25,	'La Rioja',	'2021-04-21'),
(100009,	'IRENE',	'GAS',	27,	'Salta',	'2021-04-21'),
(100010,	'JAVIER',	'GÓMEZ',	40,	'Córdoba',	'2021-04-13'),
(100011,	'JORGE',	'CURIEL',	39,	'Buenos Aires',	'2021-04-21'),
(100012,	'LAURA',	'VERDUZCO',	39,	'Buenos Aires',	'2021-04-21'),
(100013,	'MARIA',	'VARELA',	24,	'Buenos Aires',	'2021-03-20'),
(100014,	'MARTA',	'ROSAS',	43,	'Córdoba',	'2021-04-20'),
(100015,	'MIGUEL',	'VALDÉS',	34,	'Salta',	'2021-03-24'),
(100016,	'PABLO',	'VANEGAS',	39,	'Jujuy',	'2021-02-25'),
(100017,	'PAULA',	'VIVEROS',	37,	'Misiones',	'2021-03-03')

'''

cursor.execute(query)
conexion.commit()

In [72]:
query = '''
select * from  vendedores

 '''

cursor.execute(query)
# Leer los datos en un DataFrame de pandas
data = pd.read_sql_query(query, conexion)

# Mostrar los datos
print(data)
conexion.commit()

   id_vendedor  id_tienda   nombre   apellido  salario  salario_total  \
0     100003.0       1005  Antonia      Casto    20000          25000
1          NaN       1001   Adrian  Hernandez    30000              0

   bono_anual
0        5000
1           0

Ahora vamos a modificar en la tabla clientes todos los valores que digan 'Buenos Aires' por su abreviación 'BSAS'

In [54]:
query = '''
UPDATE clientes
SET provincia = 'BSAS'
WHERE provincia = 'Buenos Aires';




 '''

cursor.execute(query)
conexion.commit()

Crear nueva columna llamada bono_anual q sera un num q por defecto sea 0 y una columna salario_total q por defecto sea 0 no puede ser nula

In [66]:
query = '''
ALTER TABLE vendedores
ADD COLUMN salario_total INTEGER DEFAULT 0 NOT NULL;
'''
query2 = '''
ALTER TABLE vendedores
ADD COLUMN bono_anual INTEGER DEFAULT 0 NOT NULL;
'''

cursor.execute(query)
cursor.execute(query2)
conexion.commit()

A esa tabla de vendedores ahora les vamos a actualizar el bono_anual y el salario_total con dos sentencias UPDATE. Únicamente ANTONIA CASTRO recibirá el bono de 5000 euros.

In [68]:
query = '''

UPDATE vendedores
SET bono_anual = 5000
WHERE nombre = 'Antonia';



 '''

cursor.execute(query)
conexion.commit()

In [71]:
query = '''
UPDATE vendedores
SET salario_total = bono_anual+salario
WHERE nombre = 'Antonia';



 '''

cursor.execute(query)
conexion.commit()

In [ ]:
query = '''




 '''

cursor.execute(query)
conexion.commit()
cols = [description[0] for description in cursor.description]
pd.DataFrame(cursor.fetchall(), columns=cols)

Ahora vamos a borrar las columnas edad y fecha_alta de la tabla clientes.

In [ ]:
query = '''


 '''

cursor.execute(query)
conexion.commit()

In [ ]:
query = '''

 '''

cursor.execute(query)
conexion.commit()

In [ ]:
query = '''




 '''

cursor.execute(query)
conexion.commit()
cols = [description[0] for description in cursor.description]
pd.DataFrame(cursor.fetchall(), columns=cols)

Finalmente vamos a borrar completamente las tablas cliente y vendedores de nuestra base de datos utilizando en la sentencia IF EXISTS para evitar errores si la tabla no existe.

In [ ]:
query = '''



 '''

cursor.execute(query)
conexion.commit()

In [ ]:
query = '''



 '''

cursor.execute(query)
conexion.commit()